NextFOAM-2509/tutorials/multiphase/cavitatingFoam/LES/throttle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    ( 0.00  -2.50  -0.15)
    ( 5.00  -2.50  -0.15)
    ( 5.00  -0.15  -0.15)
    ( 7.00  -0.15  -0.15)
    ( 7.00  -2.50  -0.15)
    (17.00  -2.50  -0.15)
    (17.00  -0.15  -0.15)
    (17.00   0.15  -0.15)
    (17.00   2.50  -0.15)
    ( 7.00   2.50  -0.15)
    ( 7.00   0.15  -0.15)
    ( 5.00   0.15  -0.15)
    ( 5.00   2.50  -0.15)
    ( 0.00   2.50  -0.15)
    ( 0.00   0.15  -0.15)
    ( 0.00  -0.15  -0.15)

    ( 0.00  -2.50   0.15)
    ( 5.00  -2.50   0.15)
    ( 5.00  -0.15   0.15)
    ( 7.00  -0.15   0.15)
    ( 7.00  -2.50   0.15)
    (17.00  -2.50   0.15)
    (17.00  -0.15   0.15)
    (17.00   0.15   0.15)
    (17.00   2.50   0.15)
    ( 7.00   2.50   0.15)
    ( 7.00   0.15   0.15)
    ( 5.00   0.15   0.15)
    ( 5.00   2.50   0.15)
    ( 0.00   2.50   0.15)
    ( 0.00   0.15   0.15)
    ( 0.00  -0.15   0.15)
);

blocks
(
    hex ( 0  1  2 15 16 17 18 31) ( 50 24 1) simpleGrading (1 1 1)
    hex (15  2 11 14 31 18 27 30) ( 50  3 1) simpleGrading (1 1 1)
    hex (14 11 12 13 30 27 28 29) ( 50 24 1) simpleGrading (1 1 1)
    hex ( 2  3 10 11 18 19 26 27) ( 20  3 1) simpleGrading (1 1 1)
    hex ( 4  5  6  3 20 21 22 19) (100 24 1) simpleGrading (1 1 1)
    hex ( 3  6  7 10 19 22 23 26) (100  3 1) simpleGrading (1 1 1)
    hex (10  7  8  9 26 23 24 25) (100 24 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (15  0 16 31)
            (14 15 31 30)
            (13 14 30 29)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            ( 5  6 22 21)
            ( 6  7 23 22)
            ( 7  8 24 23)
        );
    }

    walls
    {
        type wall;
        faces
        (
            ( 1  0 16 17)
            ( 2  1 17 18)
            ( 3  2 18 19)
            ( 4  3 19 20)
            ( 5  4 20 21)
            ( 9  8 24 25)
            (10  9 25 26)
            (11 10 26 27)
            (12 11 27 28)
            (13 12 28 29)
        );
    }

    frontBack
    {
        type empty;
        faces
        (
            ( 0 15  2  1)
            (15 14 11  2)
            (14 13 12 11)
            ( 2 11 10  3)
            ( 4  3  6  5)
            ( 3 10  7  6)
            (10  9  8  7)

            (16 17 18 31)
            (31 18 27 30)
            (30 27 28 29)
            (18 19 26 27)
            (20 21 22 19)
            (19 22 23 26)
            (26 23 24 25)
        );
    }
);


// ************************************************************************* //
